yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8af5189.h
#define CAN_MCR_INRQ             CAN_MCR_bit.INRQ
#define CAN_MCR_SLEEP            CAN_MCR_bit.SLEEP
#define CAN_MCR_TXFP             CAN_MCR_bit.TXFP
#define CAN_MCR_RFLM             CAN_MCR_bit.RFLM
#define CAN_MCR_NART             CAN_MCR_bit.NART
#define CAN_MCR_AWUM             CAN_MCR_bit.AWUM
#define CAN_MCR_ABOM             CAN_MCR_bit.ABOM
#define CAN_MCR_TTCM             CAN_MCR_bit.TTCM

#define CAN_MSR_INAK             CAN_MSR_bit.INAK
#define CAN_MSR_SLAK             CAN_MSR_bit.SLAK
#define CAN_MSR_ERRI             CAN_MSR_bit.ERRI
#define CAN_MSR_WKUI             CAN_MSR_bit.WKUI
#define CAN_MSR_TX               CAN_MSR_bit.TX
#define CAN_MSR_RX               CAN_MSR_bit.RX

#define CAN_TSR_RQCP0            CAN_TSR_bit.RQCP0
#define CAN_TSR_RQCP1            CAN_TSR_bit.RQCP1
#define CAN_TSR_RQCP2            CAN_TSR_bit.RQCP2
#define CAN_TSR_TXOK0            CAN_TSR_bit.TXOK0
#define CAN_TSR_TXOK1            CAN_TSR_bit.TXOK1
#define CAN_TSR_TXOK2            CAN_TSR_bit.TXOK2

#define CAN_TPR_CODE0            CAN_TPR_bit.CODE0
#define CAN_TPR_CODE1            CAN_TPR_bit.CODE1
#define CAN_TPR_TME0             CAN_TPR_bit.TME0
#define CAN_TPR_TME1             CAN_TPR_bit.TME1
#define CAN_TPR_TME2             CAN_TPR_bit.TME2
#define CAN_TPR_LOW0             CAN_TPR_bit.LOW0
#define CAN_TPR_LOW1             CAN_TPR_bit.LOW1
#define CAN_TPR_LOW2             CAN_TPR_bit.LOW2

#define CAN_RFR_FMP              CAN_RFR_bit.FMP
#define CAN_RFR_FULL             CAN_RFR_bit.FULL
#define CAN_RFR_FOVR             CAN_RFR_bit.FOVR
#define CAN_RFR_RFOM             CAN_RFR_bit.RFOM

#define CAN_IER_TMEIE            CAN_IER_bit.TMEIE
#define CAN_IER_FMPIE            CAN_IER_bit.FMPIE
#define CAN_IER_FFIE             CAN_IER_bit.FFIE
#define CAN_IER_FOVIE            CAN_IER_bit.FOVIE
#define CAN_IER_WKUIE            CAN_IER_bit.WKUIE

#define CAN_DGR_LBKM             CAN_DGR_bit.LBKM
#define CAN_DGR_SILM             CAN_DGR_bit.SILM
#define CAN_DGR_SAMP             CAN_DGR_bit.SAMP
#define CAN_DGR_RX               CAN_DGR_bit.RX
#define CAN_DGR_TXM2E            CAN_DGR_bit.TXM2E

#define CAN_PSR_PS               CAN_PSR_bit.PS

#endif

/*-------------------------------------------------------------------------
 *      CAN bit masks
 *-----------------------------------------------------------------------*/
#define MASK_CAN_MCR_INRQ        0x01
#define MASK_CAN_MCR_SLEEP       0x02
#define MASK_CAN_MCR_TXFP        0x04
#define MASK_CAN_MCR_RFLM        0x08
#define MASK_CAN_MCR_NART        0x10
#define MASK_CAN_MCR_AWUM        0x20
#define MASK_CAN_MCR_ABOM        0x40
#define MASK_CAN_MCR_TTCM        0x80

#define MASK_CAN_MSR_INAK        0x01
#define MASK_CAN_MSR_SLAK        0x02
#define MASK_CAN_MSR_ERRI        0x04
#define MASK_CAN_MSR_WKUI        0x08
#define MASK_CAN_MSR_TX          0x10
#define MASK_CAN_MSR_RX          0x20

#define MASK_CAN_TSR_RQCP0       0x01
#define MASK_CAN_TSR_RQCP1       0x02
#define MASK_CAN_TSR_RQCP2       0x04
#define MASK_CAN_TSR_TXOK0       0x10
#define MASK_CAN_TSR_TXOK1       0x20
#define MASK_CAN_TSR_TXOK2       0x40

#define MASK_CAN_TPR_CODE0       0x01
#define MASK_CAN_TPR_CODE1       0x02
#define MASK_CAN_TPR_TME0        0x04
#define MASK_CAN_TPR_TME1        0x08
#define MASK_CAN_TPR_TME2        0x10
#define MASK_CAN_TPR_LOW0        0x20
#define MASK_CAN_TPR_LOW1        0x40
#define MASK_CAN_TPR_LOW2        0x80

#define MASK_CAN_RFR_FMP         0x03
#define MASK_CAN_RFR_FULL        0x08
#define MASK_CAN_RFR_FOVR        0x10
#define MASK_CAN_RFR_RFOM        0x20

#define MASK_CAN_IER_TMEIE       0x01
#define MASK_CAN_IER_FMPIE       0x02
#define MASK_CAN_IER_FFIE        0x04
#define MASK_CAN_IER_FOVIE       0x08
#define MASK_CAN_IER_WKUIE       0x80

#define MASK_CAN_DGR_LBKM        0x01
#define MASK_CAN_DGR_SILM        0x02
#define MASK_CAN_DGR_SAMP        0x04
#define MASK_CAN_DGR_RX          0x08
#define MASK_CAN_DGR_TXM2E       0x10

#define MASK_CAN_PSR_PS          0x07


/*-------------------------------------------------------------------------
 *      TMU register definitions
 *-----------------------------------------------------------------------*/
/* TMU key 1 */
__IO_REG8    (TMU_K1,      0x5800, __READ_WRITE);
/* TMU key 2 */
__IO_REG8    (TMU_K2,      0x5801, __READ_WRITE);
/* TMU key 3 */
__IO_REG8    (TMU_K3,      0x5802, __READ_WRITE);
/* TMU key 4 */
__IO_REG8    (TMU_K4,      0x5803, __READ_WRITE);
/* TMU key 5 */
__IO_REG8    (TMU_K5,      0x5804, __READ_WRITE);
/* TMU key 6 */
__IO_REG8    (TMU_K6,      0x5805, __READ_WRITE);
/* TMU key 7 */
__IO_REG8    (TMU_K7,      0x5806, __READ_WRITE);
/* TMU key 8 */
__IO_REG8    (TMU_K8,      0x5807, __READ_WRITE);
/* TMU status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TMUS        : 1;
  unsigned char TMUB        : 1;
  unsigned char TMUE        : 1;
  unsigned char ROPS        : 1;
} __BITS_TMU_CSR;
#endif
__IO_REG8_BIT(TMU_CSR,     0x5808, __READ, __BITS_TMU_CSR);


/*-------------------------------------------------------------------------
 *      TMU bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TMU_CSR_TMUS             TMU_CSR_bit.TMUS
#define TMU_CSR_TMUB             TMU_CSR_bit.TMUB
#define TMU_CSR_TMUE             TMU_CSR_bit.TMUE
#define TMU_CSR_ROPS             TMU_CSR_bit.ROPS

#endif

/*-------------------------------------------------------------------------
 *      TMU bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TMU_CSR_TMUS        0x01
#define MASK_TMU_CSR_TMUB        0x02
#define MASK_TMU_CSR_TMUE        0x04
#define MASK_TMU_CSR_ROPS        0x08


/*-------------------------------------------------------------------------
 *      CPU register definitions
 *-----------------------------------------------------------------------*/
/* Accumulator */
__IO_REG8    (CPU_A,       0x7F00, __READ_WRITE);
/* Program counter extended */
__IO_REG8    (CPU_PCE,     0x7F01, __READ_WRITE);
/* Program counter high */
__IO_REG8    (CPU_PCH,     0x7F02, __READ_WRITE);
/* Program counter low */
__IO_REG8    (CPU_PCL,     0x7F03, __READ_WRITE);
/* X index register high */
__IO_REG8    (CPU_XH,      0x7F04, __READ_WRITE);
/* X index register low */
__IO_REG8    (CPU_XL,      0x7F05, __READ_WRITE);
/* Y index register high */
__IO_REG8    (CPU_YH,      0x7F06, __READ_WRITE);
/* Y index register low */
__IO_REG8    (CPU_YL,      0x7F07, __READ_WRITE);
/* Stack pointer high 17h(2) */
__IO_REG8    (CPU_SPH,     0x7F08, __READ_WRITE);
/* Stack pointer low */
__IO_REG8    (CPU_SPL,     0x7F09, __READ_WRITE);
/* Condition code register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char C           : 1;
  unsigned char Z           : 1;
  unsigned char NF          : 1;
  unsigned char I0          : 1;
  unsigned char H           : 1;
  unsigned char I1          : 1;
  unsigned char             : 1;
  unsigned char V           : 1;
} __BITS_CPU_CCR;
#endif
__IO_REG8_BIT(CPU_CCR,     0x7F0A, __READ_WRITE, __BITS_CPU_CCR);

